% Variant 3. Zhdanoff Alexander
% 11-13: 39, 45, 51

% 39
% Дан целочисленный массив. Необходимо вывести вначале его элементы с
% четными индексами, а затем - с нечетными.

% 45
% Дан целочисленный массив и интервал a..b. Необходимо найти
% сумму элементов, значение которых попадает в этот интервал.



% 51
% Для введенного списка построить два списка L1 и L2, где элементы L1
% это неповторяющиеся элементы исходного списка, а элемент списка L2 с
% номером i показывает, сколько раз элемент списка L1 с таким номером
% повторяется в исходном.


% 14

% 15

% 16

% 17

% 18

% 19

% 20.3
